--Лабораторна робота №1
--студентки групи КН-32 підгрупа 1
--Кавун Анни

-- Завдання 1. Наведiть приклади виразiв вказаного типу. Кожен список має мiстити
--кiлька елементiв. Перегляньте тип прикладiв, як їх визначає ghci. Прокоментуйте.
--[([Char],[Integer])]

--[(['a'], [1..4])]
--[(['2', 'b'], [17, 4, 98])]
--[(['a', 'c', .. 'q'], [1,3..100])]

import Data.List ()
import System.IO

--Завдання 2. Функцiя визначає, чи мiстить круг початок координат. 
--Круг задається координатами центра та радiусом

--Вирішення: для цього нам потрібно визначити чи відстань
--від початку координат до центру круга є меншою за радіус.
f1 :: (Double, Double, Double) -> Bool
f1 (x, y, r)
 | (sqrt(x + y) <= r) = True 
 | otherwise = False

f2 :: Double -> Double -> Double -> Bool
f2 x y r
 | (sqrt(x + y) <= r) = True 
 | otherwise = False

 --Висновок: Під час лабораторної роботи я мала змогу ознайомитися
 --з основами мови Haskell, а саме: зі створенням функцій та їх тестування
 --та з типами мови Haskell.
