--Лабораторна робота №2
--студентки групи КН-32 підгрупа 1
--Кавун Анни
--Варіант 12

--Мета:Набути досвiду визначення рекурсивних функцiй, використання механiзму
--зiставлення зi зразком i роботи з кортежами та списками.

--Визначте вказанi функцiї в кожному з завдань: а) без застосування, б) з
--застосуванням вбудованих функцiй.

import Data.List ()
import System.IO


-- Завдання 1. Вставити у список через кожнi n елементiв вказане значення, напр.
--через n=2 значення ’z’: "1234590"⇒ "12z34z59z0".

--а) без застосування вбудованих функцій


--б) з застосуванням вбудованих функцiй
f2 :: [a] -> Int -> a -> [a]

f2 xs 0 y  = xs
f2 [] n y = []
f2 xs n y
 | length xs < n = xs
 | otherwise = take n xs ++ [y] ++ f2 (drop n xs) n y


--Завдання 2. Знайти перше просте число в указаному дiапазонi.

--а) без застосування вбудованих функцій

--{-# LANGUAGE ParallelListComp #-}
f3 :: [Int] -> Int

f3 (1:_) = 1
f3 [] = error "There is no prime number"
f3 (x:xs)
    | b = x
    | otherwise = f3 xs
    where b = and [ x `mod` y /= 0 | y <- [2..(x-1)]]


--б) з застосуванням вбудованих функцiй
f4 :: [Int] -> Int

f4 (1:_) = 1
f4 [] = error "There is no prime number"
f4 xs
    | b = x
    | otherwise = f4 (drop 1 xs)
    where 
        b = and [ x `mod` y /= 0 | y <- [2..(x-1)]]
        x = head xs

 --Висновок: Під час лабораторної роботи я здобула практичні навички створення рекурсивних функцій в haskell, 
 --а також мала додаткову практику зі списками та вбудоваинми функціями haskell, що значно полегшують написання коду.
 --Окрім того, я створила декілька функцій з використанням guards, які розширюють можливості функції, та з використанням
 --складних булевих виразів.